Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
 The CombinedDimensionAttributes class handles attributes related to the combination of identical parts of dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombinedDimensionAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CombinedDimensionAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class CombinedDimensionAttributes
	Inherits GenericAttributesBase
The DimensionSetBaseAttributes.CombinedDimensionAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes.CombinedDimensionAttributes()
 Creates a new combined dimension attributes instance. The defaults combine a minimum of three identical dimensions to be shown as the number of items times the length of the dimension.
DimensionSetBaseAttributes.CombinedDimensionAttributes(Int32, DimensionSetBaseAttributes.CombineFormats)
 Creates a new combined dimension attributes instance with the given parameters.
Top
Properties
Name | Description
Format
 The combined dimension format.
MinimumNumberToCombine
 The minimum number of dimensions to be combined.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace